[
    {
        "type": "International Conf.",
        "authors": "Junkei Okada, Tomoya Kaichi, Yuko Ozasa",
        "title": "Evaluation of Self-Attention Approach in Hyperspectral Single-Pixel Classification",
        "proc": "Proc. of IIEEJ International Conference on Image Electronics and Visual Computing (IEVC 2021), (2021.11).",
        "id": "single-pixel-self-attention",
        "abstract": "Single-pixel classification aims at classifying a pixel in an image based solely on its pixel values without relying on the surrounding pixels. Since hyperspectral images (HSIs) have many spectral bands for each pixel, HSIs can take advantage of this more than RGB images in single-pixel classification. Most previous methods for single-pixel classification of HSIs have been proposed with Convolutional Neural Networks (CNNs) or Multi-Layer Perceptron (MLP) in recent years. In this paper, we experiment with applying an attention-based method directly to hyperspectral single-pixel classification. Given a single pixel of HSIs, the attention layers can capture the long-range spectrum relationships between spectral bands and explain what dependencies the model prediction highly rely on. The experimental results indicate that the implemented attention-based ap- proach is comparable to the state-of-the-art method in classification accuracy."
    },
    {
        "type": "International Conf.",
        "authors": "Tomoya Kaichi and Yuko Ozasa",
        "title": "A Hyperspectral Approach for Unsupervised Spoof Detection with Intra-Sample Distribution",
        "proc": "Proc. of IEEE International Conference on Image Processing (ICIP) 2021, (2021.9).",
        "id": "hyper-spoof",
        "abstract": "Despite the high recognition accuracy of recent deep neural networks, they can be easily deceived by spoofing. Spoofs  (e.g., a printed photograph) visually resemble the actual objects quite closely. Thus, we propose a method for spoof detection with a hyperspectral image (HSI) that can effectively  detect differences in surface materials. In contrast to existing anti-spoofing approaches, the proposed method learns the  feature representation for spoof detection without spoof supervision. The informative pixels on an HSI are embedded  onto the feature space, and we identify the spoof from their distribution. As this is the first attempt at unsupervised spoof detection with an HSI, a new dataset that includes spoofs,  named Hyperspectral Spoof Dataset (HSSD), has been developed. The experimental results indicate that the proposed  method performs significantly better than the baselines. The source code and the dataset are available on Github."
    },
    {
        "type": "Journal",
        "authors": "Kazumasa Oniki, Toshiki Kikuchi, Yuko Ozasa",
        "title": "Training Data Generation Based on Observation Probability Density for Human Pose Refinement",
        "proc": "Journal of Image and Graphics, 9(2), 50-54,(2021.6).",
        "id": "human-pose-data-gen",
        "abstract": "Human pose estimation is an active research topic since for decades, and it has immediate applications in various tasks such as action understanding. Although accurate pose estimation is an important requirement, joint occlusion and various gestures of a person often result in deviated pose predictions. In this paper, we aim to correct such outliers included in pose estimation results. We propose a method to generate training data which is effective for learning models for outlier correction."
    },
    {
        "type": "Journal",
        "authors": "Ryuhei Ando, Yuko Ozasa, Wei Guo",
        "title": "Robust Surface Reconstruction of Plant Leaves from 3D Point Clouds",
        "proc": "Plant Phenomics, AAAS, 1-15, (2021.4).",
        "id": "3d-plant-leaves",
        "abstract": "The automation of plant phenotyping using 3D imaging techniques is indispensable. However, conventional methods for reconstructing the leaf surface from 3D point clouds have a trade-off between the accuracy of leaf surface reconstruction and the method's robustness against noise and missing points. To mitigate this trade-off, we developed a leaf surface reconstruction method that reduces the effects of noise and missing points while maintaining surface reconstruction accuracy by capturing two components of the leaf (the shape and distortion of that shape) separately using leaf-specific properties. This separation simplifies leaf surface reconstruction compared with conventional methods while increasing the robustness against noise and missing points. To evaluate the proposed method, we reconstructed the leaf surfaces from 3D point clouds of leaves acquired from two crop species (soybean and sugar beet) and compared the results with those of conventional methods. The result showed that the proposed method robustly reconstructed the leaf surfaces, despite the noise and missing points for two different leaf shapes. To evaluate the stability of the leaf surface reconstructions, we also calculated the leaf surface areas for 14 consecutive days of the target leaves. The result derived from the proposed method showed less variation of values and fewer outliers compared with the conventional methods."
    },
    {
        "type": "Journal",
        "authors": "Tomoya Kaichi, Toshiki Kikuchi, and Yuko Ozasa",
        "title": "Single-Shot Multi-light-Direction Searching on Discretized Lighting Space",
        "proc": "SN Computer Science, 2(2), 1-9, (2021.3).",
        "id": "mld",
        "abstract": "Existing methods for light direction estimation solve the problem only by presupposing certain assumptions, e.g., that only one light illuminates the object, the object has a uniform texture or smoothly varying surface, or there is a known object in the scene. However, these methods cannot be used reliably in real-world settings. We propose a framework that can be used in natural settings to estimate multi-light directions from a single image. To tackle this novel and challenging problem, we divide the lighting space into ranges and formulate the estimation problem as a problem of searching the ranges where the light is cast from a multi-illuminant image. We propose a two-step approach. First, we generate single-illuminant images, one of which assumes that there is only light on one range. Next, we select some images from the candidates that could each be a component of a multi-illuminant image under physical constraints. The experimental results demonstrated that the proposed method outperformed the direct-estimation method when the lighting space is fnely divided."
    },
    {
        "type": "International Conf.",
        "authors": "Yoshiaki Homma, Toshiki Kikuchi, and Yuko Ozasa",
        "title": "Non-Maximum Suppression for Unknown Class Objects using Image Similarity",
        "proc": "Proc. of the 16th International Joint Conference on Computer Vision Imaging and Computer Graphics Theory and Applications (VISIGRAPP 2021), 5, 444-449 (2021.2).",
        "id": "nms-unknown",
        "abstract": "As a post-processing step for object detection, non-maximum suppression (NMS) has been widely used for many years. Greedy-NMS, which is one of the most widely used NMS methods, is effective if the class of objects is known but not if the class of objects is unknown. To overcome this drawback, we propose an NMS method using an image similarity index that is independent of learning. Even if the overlap of bounding boxes that locate different objects is large, they are considered to have located different objects if the similarity of the images in the bounding boxes is low. In order to evaluate the proposed method, we built a new dataset containing unknown class objects. Our experimental results show that the proposed method can reduce the rate of undetected unknown class objects when using greedy-NMS."
    }
]