[
    {
        "type": "Domestic Conf.",
        "authors": "河村健太郎，小篠裕子",
        "title": "手のハイパースペクトル画像を用いた画素毎分類",
        "proc": "映像情報メディア学会冬季大会，(2022.12)．",
        "id": "hyper-hand-classification",
        "abstract": "Using Hyperspectral images (HSIs) for pixel-wise classification is so effective that HSIs have many spectral bands in each pixel. In this paper, we evaluate the effectiveness of using HSIs for pixel-wise classification of hands."
    },
    {
        "type": "Domestic Conf.",
        "authors": "白樫奈々，小篠裕子",
        "title": "直接観測できない物体の壁に反射した光を使った分類",
        "proc": "画像の認識・理解シンポジウム，(2022.7)．",
        "id": "hidden-obj-classification",
        "abstract": "物体がカメラから見えない場合，物体の反射した光を壁に反射させ，間接的に観測することで物体を分類するタスクを考える．本稿では壁に反射した光をハイパースペクトル（HS）カメラを用いて撮影する．壁に反射した光の領域（間接光領域）からは，目視で物体形状を推測することが困難であることは勿論，間接光領域の推定も困難である．本稿では Spectral Angle Mapper（SAM）を用いることで間接光領域の推定をする．また，分類精度の高い識別器を学習するためには大量のデータが必要であるが，間接光を撮影した HS 画像のデータセットはほとんど公開されていない．一方で，直接物体を撮影した HS 画像（HS 物体画像）のデータセットは公開されているものが多く，収集が容易である．本稿では，HS 物体画像から得られた知識を間接光による物体の分類に適用する．実験では，間接光領域の推定手法の有効性と，間接光領域を用いた物体の分類にドメイン適応を導入することの有効性を検証した．"
    },
    {
        "type": "Domestic Conf.",
        "authors": "山本周，小篠裕子",
        "title": "ハイパースペクトルデータ分類における前処理に関する一考察",
        "proc": "画像の認識・理解シンポジウム，(2022.7)．",
        "id": "hyper-preprocessing-discussion",
        "abstract": "本稿では，ハイパースペクトル（HS）画像の画素毎分類における前処理として，正規化手法と次元削減手法について考察する．HS 画像研究では，衛星・航空 HS 画像が主に扱われているが，本稿では，HS カメラがコモデティ化する未来を見据え，一般物体の HS 画像について議論する．実験の結果，データによって有効となる前処理手法に違いがあることが分かった．"
    },
    {
        "type": "Domestic Conf.",
        "authors": "岡田純京，小篠裕子",
        "title": "ハイパースペクトルデータを入力とした畳み込みニューラルネットワークが抽出した特徴の再構成",
        "proc": "画像の認識・理解シンポジウム，(2022.7)．",
        "id": "hyper-feature-reconstruction",
        "abstract": "ハイパースペクトル（Hyperspectral: HS）画像は画素毎に豊富なスペクトル情報を保有し，対象物の詳細な情報を取得できる．また行列分解をすることで，HS 画像のスペクトル情報は基底行列と係数行列の線形結合で表せる．しかし，HS 画像の行列分解は前処理に多く用いられ，分類タスクに適用された研究はほとんどない．本稿では，行列分解で得た基底行列と係数行列を用いて，ネットワークが抽出した特徴を再構成するモジュールを HS 画像の画素毎分類ネットワークに適用する．評価実験では，提案手法と比較手法にモジュールを適用することで分類精度が向上し，有効性を示した．"
    },
    {
        "type": "Domestic Conf.",
        "authors": "江藤謙，鶏内朋也，小篠裕子",
        "title": "深層学習に基づく画像分類における分布外データの挙動",
        "proc": "画像の認識・理解シンポジウム，(2022.7)．",
        "id": "deep-claffification-ood",
        "abstract": "近年，分布外データが深層学習モデルに入力された場合の挙動解析が着目されている．一方，深層学習モデルの挙動解析では，二重降下が注目されている．本稿では，二重降下が観測できる条件下において，深層学習モデルに分布外データを入力する場合の挙動を考察する．実験では，深層学習モデルにおいて，サイズの大きいモデルはサイズの小さいモデルより分布内データと分布外データに対する予測値の分散の差が大きくなることが分かった．さらに追実験より，サイズの大きいモデルが分布外データに対して高い確信度で予測する傾向が，予測値の分散の差を大きくする原因だと分かった．"
    },
    {
        "type": "Domestic Conf.",
        "authors": "岡田純京，西村仁志，小篠裕子",
        "title": "ハイパースペクトルカメラによる物体追跡の問題点に関する考察",
        "proc": "情報処理学会全国大会，(2022.3)．",
        "id": "hyper-track-analysis",
        "abstract": "ハイパースペクトル(HS)カメラは，数百バンドと高次元の波長情報を取得できるため，RGB カメラでは困難であるような，新たな画像認識手法の実現が期待されている．本稿では，ヒューマンコンピュータインタラクションやロボティクス等の多くの分野で応用される物体追跡をタスクとして設定する．従来研究では，HS 画像のバンド数を活かし，物体の素材に着目した追跡をしている．しかし，時系列 RGB 画像を用いた追跡手法よりも追跡精度が低いことがあったにも拘わらず，その原因は十分に分析されていない．本稿では，従来研究を追検証後，追跡を失敗した時系列画像を参照し，詳細な原因分析を行う．さらに，追跡を失敗した時系列画像から，HS 画像の特徴をより活かせると判断した時系列画像に対し，改善方法を考察する．"
    },
    {
        "type": "Domestic Conf.",
        "authors": "白樫奈々，鶏内朋也，小篠裕子",
        "title": "隠れた物体の反射光による物体推定",
        "proc": "情報処理学会全国大会，(2022.3)．",
        "id": "hyper-hidden-obj",
        "abstract": "遮蔽物により物体が直接カメラから観測できない場合，物体から反射した光を壁などに反射させ，間接的に観測することで，物体を推測するタスクを考える．本研究では，ハイパースペクトルカメラを用いて壁に反射した光を撮影し，物体を分類する．教師あり学習に基づく分類タスクでは，ラベル付きデータが大量に必要であるが，反射光データのラベル付けは容易ではない．そこで我々は，収集とラベル付けが比較的容易な，物体を直接撮影したハイパースペクトル画像から得られた知識を反射光による物体分類に適用する．このドメイン適応を導入した提案手法の本タスクにおける有効性を示すために，データセットを構築し，定量的に評価した．"
    }
]
